<?php
require_once "alibs/db.class.php";
class CRegion extends CDB
{
    var $reg_codes  = false;
    var $regions    = false;
    var $adj_regs   = false;
    
  
    /**
    * @desc Конструктор
    */
    function __construct($host, $user, $pass, $name)
    {
        parent::__construct($host, $user, $pass, $name);
        $this->Connect();
        $this->getRegions();
        $this->getAdjacentRegions();
    }
    
      /**
    * @desc 
    */
    function getRegions()
    {
        /*$regions = array(
            "01" => "Адыгея",
            "02" => "Башкортостан",
            "03" => "Бурятия",
            "04" => "Алтайский",
            "05" => "Дагестан",
            "06" => "Ингушетия",
            "07" => "Кабардино",
            "08" => "Калмыкия",
            "09" => "Карачаево",
            "10" => "Карелия",
            "11" => "Коми",
            "12" => "Марий",
            "13" => "Мордовия",
            "14" => "Якутия",
            "15" => "Осетия",
            "16" => "Татарстан",
            "17" => "Тыва",
            "18" => "Удмуртская",
            "19" => "Хакасия",
            "20" => "Чеченская",
            "21" => "Чувашская",
            "22" => "Алтайский",
            "23" => "Краснодарский",
            "24" => "Красноярский",
            "25" => "Приморский",
            "26" => "Ставропольский",
            "27" => "Хабаровский",
            "28" => "Амурская",
            "29" => "Архангельская",
            "30" => "Астраханская",
            "31" => "Белгородская",
            "32" => "Брянская",
            "33" => "Владимирская",
            "34" => "Волгоградская",
            "35" => "Вологодская",
            "36" => "Воронежская",
            "37" => "Ивановская",
            "38" => "Иркутская",
            "39" => "Калининградская",
            "40" => "Калужская",
            "41" => "Камчатский",
            "42" => "Кемеровская",
            "43" => "Кировская",
            "44" => "Костромская",
            "45" => "Курганская",
            "46" => "Курская",
            "47" => "Ленинградская",
            "48" => "Липецкая",
            "49" => "Магаданская",
            "50" => "Московская",
            "51" => "Мурманская",
            "52" => "Нижегородская",
            "53" => "Новгородская",
            "54" => "Новосибирская",
            "55" => "Омская",
            "56" => "Оренбургская",
            "57" => "Орловская",
            "58" => "Пензенская",
            "59" => "Пермский",
            "60" => "Псковская",
            "61" => "Ростовская",
            "62" => "Рязанская",
            "63" => "Самарская",
            "64" => "Саратовская",
            "65" => "Сахалинская",
            "66" => "Свердловская",
            "67" => "Смоленская",
            "68" => "Тамбовская",
            "69" => "Тверская",
            "70" => "Томская",
            "71" => "Тульская",
            "72" => "Тюменская",
            "73" => "Ульяновская",
            "74" => "Челябинская",
            "75" => "Забайкальский",
            "76" => "Ярославская",
            "77" => "Москва",
            "78" => "Петербург",
            "79" => "Еврейская",
            "80" => "Забайкальский",
            "81" => "Пермский",
            "82" => "Камчатский",
            "83" => "Ненецкий",
            "84" => "Красноярский",
            "85" => "Иркутская",
            "86" => "Ханты",
            "87" => "Чукотский",
            "88" => "Красноярский",
            "89" => "Ямало",
            "90" => "Крым",
            "91" => "Севастополь",
        );
        */
        $this->regions   = array();
        $this->reg_codes = array();
        $query = "SELECT * FROM `regions` WHERE 1";

        if ($res = $this->GetRows($query))
        {   
            foreach ($res as $row)
            {
                $id   = $row['id'];
                $num  = $row['num'];
                $name = $row['name'];
                $this->regions[$id] = $row;
                $this->reg_codes[$num] = $row;//$name;
            }
        }



        return $this->reg_codes;
    }
    
    /**
    * @desc 
    */
    function getAdjacentRegions()
    {
        $this->adj_regs = array();
        $query = "SELECT * FROM `adjacent_regions` WHERE 1;";
        if ($res = $this->GetRows($query))
        {
            foreach ($res as $row)
            {
                $id1 = $row['region_id1'];
                $id2 = $row['region_id2'];
                if (!isset($this->adj_regs[$id1])) $this->adj_regs[$id1] = array();
                $this->adj_regs[$id1][$id2] = 1;
                if (!isset($this->adj_regs[$id2])) $this->adj_regs[$id2] = array();
                $this->adj_regs[$id2][$id1] = 1;
            }           
        }
        return $this->adj_regs;
    }
    
     /**
    * @desc 
    */
    function getRegion($cadno)
    {
        
        if (!$this->reg_codes) $this->reg_codes = $this->getRegions();
        
        if ($cadno)
        {
            $code_arr = explode(":",$cadno);
            $code     = array_shift($code_arr);

            if (isset($this->reg_codes[$code])) return $this->reg_codes[$code];
        }
        return false;
    }
   
    
    
}
  
?>
